In [1]:
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
userdf = pd.read_csv(r"K:\MachineProject\Data\ml-1m\users.dat",delimiter= "::", header=None)

C:\Users\Ahmed\AppData\Local\Temp\ipykernel_3120\2268184611.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  userdf = pd.read_csv(r"K:\MachineProject\Data\ml-1m\users.dat",delimiter= "::", header=None)

In [3]:
userdf.head(-1)

         0  1   2   3      4
0        1  F   1  10  48067
1        2  M  56  16  70072
2        3  M  25  15  55117
3        4  M  45   7  02460
4        5  M  25  20  55455
...    ... ..  ..  ..    ...
6034  6035  F  25   1  78734
6035  6036  F  25  15  32603
6036  6037  F  45   1  76006
6037  6038  F  56   1  14706
6038  6039  F  45   0  01060

[6039 rows x 5 columns]

In [4]:
userdf = userdf.drop(3, axis=1)
userdf = userdf.drop(4, axis=1)

In [5]:
userdf.head(-1)

         0  1   2
0        1  F   1
1        2  M  56
2        3  M  25
3        4  M  45
4        5  M  25
...    ... ..  ..
6034  6035  F  25
6035  6036  F  25
6036  6037  F  45
6037  6038  F  56
6038  6039  F  45

[6039 rows x 3 columns]

In [6]:
from sklearn.preprocessing import OneHotEncoder , StandardScaler , LabelEncoder

In [7]:
userdf[1] = userdf[1].replace({'M':1,'F':0})

C:\Users\Ahmed\AppData\Local\Temp\ipykernel_3120\2003514375.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  userdf[1] = userdf[1].replace({'M':1,'F':0})

In [8]:
userdf.head(-1)

         0  1   2
0        1  0   1
1        2  1  56
2        3  1  25
3        4  1  45
4        5  1  25
...    ... ..  ..
6034  6035  0  25
6035  6036  0  25
6036  6037  0  45
6037  6038  0  56
6038  6039  0  45

[6039 rows x 3 columns]

In [9]:
userdf.columns = ["UserID", "Gender", "Age"]

In [10]:
userdf.info()
userdf.head(-1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6040 entries, 0 to 6039
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   UserID  6040 non-null   int64
 1   Gender  6040 non-null   int64
 2   Age     6040 non-null   int64
dtypes: int64(3)
memory usage: 141.7 KB

      UserID  Gender  Age
0          1       0    1
1          2       1   56
2          3       1   25
3          4       1   45
4          5       1   25
...      ...     ...  ...
6034    6035       0   25
6035    6036       0   25
6036    6037       0   45
6037    6038       0   56
6038    6039       0   45

[6039 rows x 3 columns]

In [11]:
moviedf = pd.read_csv(r"K:\MachineProject\Data\ml-1m\movies.dat",delimiter= "::", header=None, encoding='latin-1')

C:\Users\Ahmed\AppData\Local\Temp\ipykernel_3120\558042657.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  moviedf = pd.read_csv(r"K:\MachineProject\Data\ml-1m\movies.dat",delimiter= "::", header=None, encoding='latin-1')

In [12]:
moviedf.head(-1)

         0                                   1                             2
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy
...    ...                                 ...                           ...
3877  3947                   Get Carter (1971)                      Thriller
3878  3948             Meet the Parents (2000)                        Comedy
3879  3949          Requiem for a Dream (2000)                         Drama
3880  3950                    Tigerland (2000)                         Drama
3881  3951             Two Family House (2000)                         Drama

[3882 rows x 3 columns]

In [13]:
moviedf.columns = ["MovieID", "Title", "Genres"]
moviedf['Year'] = moviedf['Title'].str.extract(r'\((\d{4})\)')  # Extracts year
moviedf['Title'] = moviedf['Title'].str.replace(r'\(\d{4}\)', '', regex=True).str.strip()  # Removes year from title
moviedf.head(-1)

      MovieID                        Title                        Genres  Year
0           1                    Toy Story   Animation|Children's|Comedy  1995
1           2                      Jumanji  Adventure|Children's|Fantasy  1995
2           3             Grumpier Old Men                Comedy|Romance  1995
3           4            Waiting to Exhale                  Comedy|Drama  1995
4           5  Father of the Bride Part II                        Comedy  1995
...       ...                          ...                           ...   ...
3877     3947                   Get Carter                      Thriller  1971
3878     3948             Meet the Parents                        Comedy  2000
3879     3949          Requiem for a Dream                         Drama  2000
3880     3950                    Tigerland                         Drama  2000
3881     3951             Two Family House                         Drama  2000

[3882 rows x 4 columns]

In [14]:
moviedf.isnull().sum()
moviedf = moviedf.drop_duplicates()
moviedf.head(-1)

      MovieID                        Title                        Genres  Year
0           1                    Toy Story   Animation|Children's|Comedy  1995
1           2                      Jumanji  Adventure|Children's|Fantasy  1995
2           3             Grumpier Old Men                Comedy|Romance  1995
3           4            Waiting to Exhale                  Comedy|Drama  1995
4           5  Father of the Bride Part II                        Comedy  1995
...       ...                          ...                           ...   ...
3877     3947                   Get Carter                      Thriller  1971
3878     3948             Meet the Parents                        Comedy  2000
3879     3949          Requiem for a Dream                         Drama  2000
3880     3950                    Tigerland                         Drama  2000
3881     3951             Two Family House                         Drama  2000

[3882 rows x 4 columns]

In [15]:
moviedf['Genres'] = moviedf['Genres'].str.split('|')
moviedf.head(-1)

,MovieID,Title,Genres,Year
0,1,Toy Story,"[Animation, Children's, Comedy]",1995
1,2,Jumanji,"[Adventure, Children's, Fantasy]",1995
2,3,Grumpier Old Men,"[Comedy, Romance]",1995
3,4,Waiting to Exhale,"[Comedy, Drama]",1995
4,5,Father of the Bride Part II,[Comedy],1995
...,...,...,...,...
3877,3947,Get Carter,[Thriller],1971
3878,3948,Meet the Parents,[Comedy],2000
3879,3949,Requiem for a Dream,[Drama],2000
3880,3950,Tigerland,[Drama],2000
3881,3951,Two Family House,[Drama],2000

In [16]:
genre_mapping = {
    "Action": 1, "Adventure": 2, "Animation": 3, "Children's": 4, "Comedy": 5,
    "Crime": 6, "Documentary": 7, "Drama": 8, "Fantasy": 9, "Film-Noir": 10,
    "Horror": 11, "Musical": 12, "Mystery": 13, "Romance": 14, "Sci-Fi": 15,
    "Thriller": 16, "War": 17, "Western": 18
}

moviedf['Genres'] = moviedf['Genres'].apply(lambda genres: [genre_mapping[g] for g in genres])
moviedf.head(-1)

      MovieID                        Title     Genres  Year
0           1                    Toy Story  [3, 4, 5]  1995
1           2                      Jumanji  [2, 4, 9]  1995
2           3             Grumpier Old Men    [5, 14]  1995
3           4            Waiting to Exhale     [5, 8]  1995
4           5  Father of the Bride Part II        [5]  1995
...       ...                          ...        ...   ...
3877     3947                   Get Carter       [16]  1971
3878     3948             Meet the Parents        [5]  2000
3879     3949          Requiem for a Dream        [8]  2000
3880     3950                    Tigerland        [8]  2000
3881     3951             Two Family House        [8]  2000

[3882 rows x 4 columns]

In [17]:
ratingdf = pd.read_csv(r"K:\MachineProject\Data\ml-1m\ratings.dat",delimiter= "::", header=None)

C:\Users\Ahmed\AppData\Local\Temp\ipykernel_3120\3447831810.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  ratingdf = pd.read_csv(r"K:\MachineProject\Data\ml-1m\ratings.dat",delimiter= "::", header=None)

In [18]:
ratingdf.info()
ratingdf.head(-1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000209 entries, 0 to 1000208
Data columns (total 4 columns):
 #   Column  Non-Null Count    Dtype
---  ------  --------------    -----
 0   0       1000209 non-null  int64
 1   1       1000209 non-null  int64
 2   2       1000209 non-null  int64
 3   3       1000209 non-null  int64
dtypes: int64(4)
memory usage: 30.5 MB

            0     1  2          3
0           1  1193  5  978300760
1           1   661  3  978302109
2           1   914  3  978301968
3           1  3408  4  978300275
4           1  2355  5  978824291
...       ...   ... ..        ...
1000203  6040  1090  3  956715518
1000204  6040  1091  1  956716541
1000205  6040  1094  5  956704887
1000206  6040   562  5  956704746
1000207  6040  1096  4  956715648

[1000208 rows x 4 columns]

In [19]:
ratingdf = ratingdf.drop([3], axis=1)
ratingdf.columns = ["UserID", "MovieID", "Rating"]
ratingdf.head(-1)

         UserID  MovieID  Rating
0             1     1193       5
1             1      661       3
2             1      914       3
3             1     3408       4
4             1     2355       5
...         ...      ...     ...
1000203    6040     1090       3
1000204    6040     1091       1
1000205    6040     1094       5
1000206    6040      562       5
1000207    6040     1096       4

[1000208 rows x 3 columns]

In [20]:
scaler = StandardScaler()
ratingdf['Rating'] = scaler.fit_transform(ratingdf[['Rating']])
ratingdf.head(-1)

         UserID  MovieID    Rating
0             1     1193  1.269747
1             1      661 -0.520601
2             1      914 -0.520601
3             1     3408  0.374573
4             1     2355  1.269747
...         ...      ...       ...
1000203    6040     1090 -0.520601
1000204    6040     1091 -2.310949
1000205    6040     1094  1.269747
1000206    6040      562  1.269747
1000207    6040     1096  0.374573

[1000208 rows x 3 columns]

In [23]:
ratingdf['Rating'].value_counts()
ratingdf['Rating'].describe()

count    1.000209e+06
mean    -4.748986e-17
std      1.000000e+00
min     -2.310949e+00
25%     -5.206014e-01
50%      3.745726e-01
75%      3.745726e-01
max      1.269747e+00
Name: Rating, dtype: float64

In [24]:
# Merge ratingdf with userdf on UserID
merged_df = ratingdf.merge(userdf, on="UserID", how="inner")

# Merge with moviedf on MovieID
merged_df = merged_df.merge(moviedf, on="MovieID", how="inner")

# Save to CSV
merged_df.to_csv(r"K:\MachineProject\Data\ml-1m\merged_data.csv", index=False)

# Check the merged dataframe
print(merged_df.head())

   UserID  MovieID    Rating  Gender  Age                            Title  \
0       1     1193  1.269747       0    1  One Flew Over the Cuckoo's Nest
1       1      661 -0.520601       0    1        James and the Giant Peach
2       1      914 -0.520601       0    1                     My Fair Lady
3       1     3408  0.374573       0    1                  Erin Brockovich
4       1     2355  1.269747       0    1                    Bug's Life, A

       Genres  Year
0         [8]  1975
1  [3, 4, 12]  1996
2    [12, 14]  1964
3         [8]  2000
4   [3, 4, 5]  1998